tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# brew
brew "ack"
brew "asdf"
brew "bash-completion"
brew "bash-git-prompt"
brew "dockutil"
brew "exiftool"
brew "p11-kit"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gd"
brew "ghostscript"
brew "gifsicle"
brew "git-lfs"
brew "libassuan"
brew "gnupg"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "imagesnap"
brew "jq"
brew "libdvdcss"
brew "mas"
brew "numpy"
brew "pytorch"
brew "openai-whisper"
brew "openvino"
brew "python@3.8"
brew "qt"
brew "serve"
brew "telnet"
brew "terraform"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"

# casks
cask "1password"
cask "arc"
cask "audio-hijack"
cask "caffeine"
cask "cursor"
cask "db-browser-for-sqlite"
cask "descript"
cask "discord"
cask "docker"
cask "dropbox"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "figma"
cask "firefox"
cask "font-inter"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-open-sans"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "kap"
cask "licecap"
cask "loom"
cask "loopback"
cask "maccy"
cask "macvim"
cask "marked"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "ngrok"
cask "notion"
# cask "obs" # only install on desktops
cask "obsidian"
cask "ollama"
cask "openemu"
# cask "parallels" # only install on desktops
cask "pop"
cask "postico"
# postgres.app: https://postgresapp.com/downloads.html
cask "qlmarkdown"
cask "rapidapi"
cask "raycast"
cask "remarkable"
cask "screen-studio"
cask "sizeup"
# cask "sketch" # deprecated
cask "slack"
cask "spotify"
# cask "streamlabs" # only install on desktops
cask "sublime-text"
# superwhisper
cask "telegram"
cask "tuple"
cask "typefully"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"

mas "Bear", id: 1091189122
mas "Capo", id: 696977615
mas "Dato", id: 1470584107
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sip", id: 507257563
mas "Tomato 2", id: 1494210770
mas "Trello", id: 1278508951
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835

vscode "adamhartford.vscode-base64"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "folke.vscode-monorepo-workspace"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "zxh404.vscode-proto3"
