tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Command Line Utils
brew "ack"
brew "asdf"
brew "bash-completion"
brew "bash-git-prompt"
brew "exiftool"
brew "dockutil"
brew "p11-kit"
brew "ffmpeg"
brew "gifsicle"
brew "git-lfs"
brew "gnupg"
brew "gobject-introspection"
brew "python@3.8"
brew "gts"
brew "pango"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "imagesnap"
brew "jq"
brew "libdvdcss"
brew "mas"
brew "qt"
brew "serve"
brew "telnet"
brew "terraform"
brew "wget"
brew "youtube-dl"

# Apps
cask "1password"
cask "arc"
cask "audio-hijack"
cask "caffeine"
cask "db-browser-for-sqlite"
cask "descript"
cask "discord"
cask "docker"
cask "dropbox"
cask "elgato-control-center"
cask "figma"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-open-sans"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "kap"
cask "keybase"
cask "licecap"
cask "loom"
cask "loopback"
cask "maccy"
cask "macvim"
cask "marked"
cask "microsoft-office"
cask "notion"
cask "obs"
cask "obsidian"
cask "openemu"
cask "pop"
cask "raycast"
cask "remarkable"
cask "sizeup"
cask "sketch"
cask "slack"
cask "spotify"
cask "streamlabs-obs"
cask "sublime-text"
cask "telegram"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"

# Apps from Mac App Store
mas "Bear", id: 1091189122
mas "Capo", id: 696977615
mas "Craft", id: 1487937127
mas "Dato", id: 1470584107
mas "FocusLite", id: 1515566936
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "MainStage", id: 634159523
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sip", id: 507257563
mas "Tomato 2", id: 1494210770
mas "Trello", id: 1278508951
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835

# VSCode extensions
vscode "adamhartford.vscode-base64"
vscode "adpyke.codesnap"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "folke.vscode-monorepo-workspace"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "JuanBlanco.solidity"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "OfHumanBondage.react-proptypes-intellisense"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "zxh404.vscode-proto3"
