tap "a5huynh/brew"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"

brew "ack"
brew "ansible"
brew "asdf"
brew "awscli"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "dockutil"
brew "p11-kit"
brew "gnutls"
brew "gobject-introspection"
brew "ffmpeg"
brew "gnupg"
brew "gts"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "imagesnap"
brew "libdvdcss"
brew "mas"
brew "svn"
brew "telnet"
brew "terraform"
brew "wget"
brew "youtube-dl"
brew "a5huynh/brew/cub-cli"
brew "heroku/brew/heroku"

cask "1password"
cask "alfred"
cask "anki"
cask "asix-ax88179" # usb ethernet drivers
cask "caffeine"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dropbox"
cask "elgato-control-center"
cask "figma"
cask "fluid"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-open-sans"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "licecap"
cask "loom"
cask "macs-fan-control"
cask "macvim"
cask "marked"
cask "microsoft-office"
cask "miro"
cask "nightowl"
cask "notion"
cask "obs"
cask "openemu"
cask "react-native-debugger"
cask "rescuetime"
cask "sip"
cask "sizeup"
cask "sketch"
cask "sketchup"
cask "skitch"
cask "skype"
cask "slack"
cask "spotify"
cask "streamlabs-obs"
cask "sublime-text"
cask "telegram"
cask "tidal"
cask "toggl-track"
cask "tuple"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zoom"

mas "Bear", id: 1091189122
mas "Capo", id: 696977615
mas "Clocks", id: 414554506
mas "Dato", id: 1470584107
mas "FocusLite", id: 1515566936
mas "Hand Mirror", id: 1502839586
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Sip", id: 507257563
mas "Tomato 2", id: 1494210770
mas "Tomato One", id: 907364780
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835

# Uncomment for desktop machines
# TODO 2021-07: Move into separate Brewfile
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "MainStage 3", id: 634159523
